--[[
    demo
    Author: hunzsig
]]

local kit = "lik_demo"

local ui = UIKit(kit)

ui:onRefresh(1, function(this)
    FrameTooltips()
        :kit(kit)
        :content(
        {
            tips = {
                "中国人不骗中国人中国人不骗中国人中国人不骗中国人中国人不骗中国人中国人不骗中国人中国人不骗中国人中国人不骗中国人中国人不骗中国人",
                "中国人不骗中国人中国人不骗中国人中国人不骗中国人中国人不骗中国人中国人不骗中国人中国人不骗中国人中国人不骗中国人中国人不骗中国人",
                "中国人不骗中国人中国人不骗中国人中国人不骗中国人中国人不骗中国人中国人不骗中国人中国人不骗中国人中国人不骗中国人中国人不骗中国人",
                "中国人不骗中国人中国人不骗中国人中国人不骗中国人中国人不骗中国人中国人不骗中国人中国人不骗中国人中国人不骗中国人中国人不骗中国人",
                "中国人不骗中国人中国人不骗中国人中国人不骗中国人中国人不骗中国人中国人不骗中国人中国人不骗中国人中国人不骗中国人中国人不骗中国人",
                "中国人不骗中国人中国人不骗中国人中国人不骗中国人中国人不骗中国人中国人不骗中国人中国人不骗中国人中国人不骗中国人中国人不骗中国人",
                "中国人不骗中国人中国人不骗中国人中国人不骗中国人中国人不骗中国人中国人不骗中国人中国人不骗中国人中国人不骗中国人中国人不骗中国人",
                "中国人不骗中国人中国人不骗中国人中国人不骗中国人中国人不骗中国人中国人不骗中国人中国人不骗中国人中国人不骗中国人中国人不骗中国人",
                "中国人不骗中国人中国人不骗中国人中国人不骗中国人中国人不骗中国人中国人不骗中国人中国人不骗中国人中国人不骗中国人中国人不骗中国人",
                "中国人不骗中国人中国人不骗中国人中国人不骗中国人中国人不骗中国人中国人不骗中国人中国人不骗中国人中国人不骗中国人中国人不骗中国人",
                "中国人不骗中国人中国人不骗中国人中国人不骗中国人中国人不骗中国人中国人不骗中国人中国人不骗中国人中国人不骗中国人中国人不骗中国人",
                "中国人不骗中国人中国人不骗中国人中国人不骗中国人中国人不骗中国人中国人不骗中国人中国人不骗中国人中国人不骗中国人中国人不骗中国人",
                --"17310574857410985678648174-931748386431784703194713-94783149-318-4",
                --"17310574857410985678648174-931748386431784703194713-94783149-318-4",
                --"17310574857410985678648174-931748386431784703194713-94783149-318-4",
                --"17310574857410985678648174-931748386431784703194713-94783149-318-4",
                --"17310574857410985678648174-931748386431784703194713-94783149-318-4",
                --"17310574857410985678648174-931748386431784703194713-94783149-318-4",
                --"17310574857410985678648174-931748386431784703194713-94783149-318-4",
                --"NIODHJIFPDEHQIPFHEQIOUFHEQIOFPHEQUHIOBHUHBUDHISAHDOPWHJODQWJDOPQWJ",
                --"NIODHJIFPDEHQIPFHEQIOUFHEQIOFPHEQUHIOBHUHBUDHISAHDOPWHJODQWJDOPQWJ",
                --"NIODHJIFPDEHQIPFHEQIOUFHEQIOFPHEQUHIOBHUHBUDHISAHDOPWHJODQWJDOPQWJ",
                --"NIODHJIFPDEHQIPFHEQIOUFHEQIOFPHEQUHIOBHUHBUDHISAHDOPWHJODQWJDOPQWJ",
                --"NIODHJIFPDEHQIPFHEQIOUFHEQIOFPHEQUHIOBHUHBUDHISAHDOPWHJODQWJDOPQWJ",
                --"NIODHJIFPDEHQIPFHEQIOUFHEQIOFPHEQUHIOBHUHBUDHISAHDOPWHJODQWJDOPQWJ",
                --"NIODHJIFPDEHQIPFHEQIOUFHEQIOFPHEQUHIOBHUHBUDHISAHDOPWHJODQWJDOPQWJ",
            }
        })
        :show(true)
end)
